       IDENTIFICATION DIVISION.
       PROGRAM-ID.   TEST-ORBITAL-SEPARATION.
       AUTHOR.       Markku Sukanen.
       DATE-WRITTEN. June 11, 2025.
       COPY          TESTENV.
      ******************************************************************
      *
      * Test orbital separation generation.
      *
      ******************************************************************
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
           STOP RUN.
