       IDENTIFICATION DIVISION.
       PROGRAM-ID. VARIATST.
       AUTHOR.     Markku Sukanen.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. WSL WITH DEBUGGING MODE.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  RET-VAL        PIC 9(5)V9(5) USAGE COMP-3.
       01  VAR-PERCENTAGE PIC 9(5)V9(5) USAGE COMP-3.
       01  VAR-VALUE      PIC 9(5)V9(5) USAGE COMP-3.

       PROCEDURE DIVISION.
           MOVE 10.0 TO VAR-PERCENTAGE
           MOVE 100.0 TO VAR-VALUE
           CALL 'ALTER-VALUE-BY-PERCENTAGE' USING
               VAR-PERCENTAGE, VAR-VALUE, RET-VAL.
           GOBACK.
