       IDENTIFICATION DIVISION.
       PROGRAM-ID. G4SSG.
       AUTHOR.     Markku Sukanen.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  PARM.
           05  PARM-LENGTH      PIC 9(4).
           05  PARM-DATA        PIC X(100).

       PROCEDURE DIVISION.
           ACCEPT PARM-DATA FROM COMMAND-LINE.
           IF PARM-DATA EQUAL SPACES THEN
               ACCEPT PARM-DATA FROM ENVIRONMENT "PARM"
           END-IF.
           MOVE FUNCTION STORED-CHAR-LENGTH(PARM-DATA) TO PARM-LENGTH.
           CALL 'G4SSGCRE' USING PARM.
           GOBACK.
