      ******************************************************************
      * Asteroid data.
      *
           05  ASTEROID-CORE-TYPE      PIC X.
               COPY ABDATA.
           05  ASTEROID-ICYS           PIC X VALUE 'N'.
               COPY ABDATICE.
