       01  ANSI-ESC                    PIC X VALUE X"1B".               ESC
       01  ANSI-RED-BOLD               PIC X(6) VALUE '[1;31m'.
       01  ANSI-YELLOW-BOLD            PIC X(6) VALUE '[1;33m'.
       01  ANSI-GREEN                  PIC X(4) VALUE '[32m'.
       01  ANSI-RESET                  PIC X(3) VALUE '[0m'.
       