      ******************************************************************
      * Gas giant related data resides here.
      *
           05  RADIUS                  USAGE COMP-2.
           05  SIZE-CATEGORY           PIC X.
               COPY GGSZCAT.
