      ******************************************************************
      * WS-SYSTEM-AGE, etc.
      *
           10  BYR                     USAGE COMP-2.
           10  POPULATION              PIC XX.
               COPY STLRPOP.
