      ******************************************************************
      * WS-SYSTEM-AGE, etc.
      *
           05  BYR                     USAGE COMP-2.
           05  POPULATION              PIC XX.
               COPY STLRPOP.
