      ******************************************************************
      * WS-SYSTEM-AGE, etc.
      *
      *        Age is in billions of years, naturally.
           10  BYR                     USAGE COMP-2.
      *        Population I / II, and the intermediates between.
           10  POPULATION              PIC XX.
               COPY STLRPOP.
