       IDENTIFICATION DIVISION.
       PROGRAM-ID.   GEN-GAS-GIANT.
       AUTHOR.       Markku Sukanen.
       DATE-WRITTEN. June 5, 2025
      ******************************************************************
      *
      * Generate a gas giant.
      *
      ******************************************************************
       PROCEDURE DIVISION.
           GOBACK.
