       IDENTIFICATION DIVISION.
       PROGRAM-ID.   GEN-TERRESTRIAL.
       AUTHOR.       Markku Sukanen.
       DATE-WRITTEN. June 5, 2025.
      ******************************************************************
      *
      * Generate a terrestrial planet.
      *
      ******************************************************************
       PROCEDURE DIVISION.
           GOBACK.
