       COMPUTE WS-CHANGE ROUNDED = FUNCTION RANDOM * VAR-BY-UPTO
       IF FUNCTION RANDOM < 0.5 THEN
           COMPUTE RET-VALUE ROUNDED = VAR-VALUE - WS-CHANGE
       ELSE
           COMPUTE RET-VALUE ROUNDED = VAR-VALUE + WS-CHANGE
       END-IF
