      * Infinite (but not really) life-span.
       77  INF-LIFESPAN                PIC 9(5)V9 VALUE 99999.9.        CONSTANT
      * Generic - something-not-available - value.
       77  NOT-AVAILABLE               PIC 9V9 VALUE 0.0.               CONSTANT
