      ******************************************************************
      * Gas giant info.
      *
       15  GG-SIZE                     PIC X VALUE 'M'.
           88  GG-SMALL                VALUE 'S'.
           88  GG-MEDIUM               VALUE 'M'.
           88  GG-LARGE                VALUE 'L'.
           88  GG-HUGE                 VALUE 'H'.
