      ******************************************************************
      * Terrestrial planet info.
      *
       15  TERR-SIZE                   PIC X VALUE 'E'.
           88  EARTH-SIZED             VALUE 'E'.
           88  MOON-SIZED              VALUE 'M'.
           88  SUPEREARTH-SIZED        VALUE 'S'.
