           25  INNER-LIMIT             PIC 9(5)V9(5) USAGE COMP-3.         AU
           25  OUTER-LIMIT             PIC 9(5)V9(5) USAGE COMP-3.         AU
           25  SNOW-LINE               PIC 9(5)V9(5) USAGE COMP-3.         AU
