       05  ORBIT-SEPARATION.
           10  SEP-CATEGORY            PIC 9.
               COPY ORBSEP.
           10  SEP-ECC                 PIC 9V99 USAGE COMP-3.
           10  SEP-MIN                 PIC 9(5)V9(5) USAGE COMP-3.         AU
           10  SEP-AVG                 PIC 9(5)V9(5) USAGE COMP-3.         AU
           10  SEP-MAX                 PIC 9(5)V9(5) USAGE COMP-3.         AU
