      ******************************************************************
      * A star's orbital zones.
      *
       10  OZ-INNER-LIMIT          PIC 9(5)V9(5) USAGE COMP-3.          AU
       10  OZ-OUTER-LIMIT          PIC 9(5)V9(5) USAGE COMP-3.          AU
       10  OZ-SNOW-LINE            PIC 9(5)V9(5) USAGE COMP-3.          AU
