       05  EVO-MASS                PIC 9(5)V9(5) USAGE COMP-3.
       05  EVO-APPROX-TYPE         PIC X9.
       05  EVO-AVG-TEMP            PIC 9(5)V9(2) USAGE COMP-3.
       05  EVO-L-MIN               PIC 9(5)V9(5) USAGE COMP-3.
       05  EVO-L-MAX               PIC 9(5)V9(5) USAGE COMP-3.
       05  EVO-M-SPAN              PIC 9(5)V9(5) USAGE COMP-3.
       05  EVO-S-SPAN              PIC 9(5)V9(5) USAGE COMP-3.
       05  EVO-G-SPAN              PIC 9(5)V9(5) USAGE COMP-3.
